#include "I2C.h"


/**********************************************************************************************************
*	函 数 名: i2c_Delay
*	功能说明: I2C总线位延迟
*	形    参：无
*	返 回 值: 无
**********************************************************************************************************/

static void i2c_Delay(void)
{
	volatile uint8_t i;

	/*　
		CPU主频168MHz时，在内部Flash运行, MDK工程不优化。用台式示波器观测波形。
		循环次数为5时，SCL频率 = 1.78MHz (读耗时: 92ms, 读写正常，但是用示波器探头碰上就读写失败。时序接近临界)
		循环次数为10时，SCL频率 = 1.1MHz (读耗时: 138ms, 读速度: 118724B/s)
		循环次数为30时，SCL频率 = 440KHz， SCL高电平时间1.0us，SCL低电平时间1.2us
		上拉电阻选择2.2K欧时，SCL上升沿时间约0.5us，如果选4.7K欧，则上升沿约1us
		实际应用选择400KHz左右的速率即可
	*/
	for (i = 0; i < 10; i++);
}


/**********************************************************************************************************
*	函 数 名: i2c_Start
*	功能说明: CPU发起I2C总线启动信号
*	形    参：i2c：结构体指针
*	返 回 值: 无
**********************************************************************************************************/

void i2c_Start( I2C *i2c )
{
  i2c->IIC_SDA_H();
	i2c->IIC_SDA_H();
	i2c->IIC_SCL_H();
	i2c_Delay();
	i2c->IIC_SDA_L();
	i2c_Delay();
	i2c->IIC_SCL_L();
	i2c_Delay();    
}


/**********************************************************************************************************
*	函 数 名: i2c_Stop
*	功能说明: CPU发起I2C总线停止信号
*	形    参：i2c：结构体指针
*	返 回 值: 无
**********************************************************************************************************/

void i2c_Stop( I2C *i2c )
{
	i2c->IIC_SDA_L();
	i2c->IIC_SCL_H();
	i2c_Delay();
	i2c->IIC_SDA_H();
}


/**********************************************************************************************************
*	函 数 名: i2c_SendByte
*	功能说明: CPU向I2C总线设备发送8bit数据
*	形    参：i2c：结构体指针，_ucByte ： 等待发送的字节
*	返 回 值: 无
**********************************************************************************************************/

void i2c_SendByte( I2C *i2c, uint8_t _ucByte)
{
	uint8_t i;

	/* 先发送字节的高位bit7 */
	for (i = 0; i < 8; i++)
	{
		if (_ucByte & 0x80)
		{
			i2c->IIC_SDA_H();
		}
		else
		{
			i2c->IIC_SDA_L();
		}
		i2c_Delay();
		i2c->IIC_SCL_H();
		i2c_Delay();
		i2c->IIC_SCL_L();
		if (i == 7)
		{
			 i2c->IIC_SDA_H(); // 释放总线
		}
		_ucByte <<= 1;	/* 左移一个bit */
		i2c_Delay();
	}
}


/**********************************************************************************************************
*	函 数 名: i2c_ReadByte
*	功能说明: CPU从I2C总线设备读取8bit数据
*	形    参：i2c：结构体指针
*	返 回 值: 读到的数据
**********************************************************************************************************/

uint8_t i2c_ReadByte( I2C *i2c )
{
	uint8_t i;
	uint8_t value;

	/* 读到第1个bit为数据的bit7 */
	value = 0;
	for (i = 0; i < 8; i++)
	{
		value <<= 1;
		i2c->IIC_SCL_H();
		i2c_Delay();
                
		if ( i2c->IIC_READ() )
		{
			value++;
		}
                
		i2c->IIC_SCL_L();
		i2c_Delay();
	}
        
	return value;
}


/**********************************************************************************************************
*	函 数 名: i2c_WaitAck
*	功能说明: CPU产生一个时钟，并读取器件的ACK应答信号
*	形    参：i2c：结构体指针
*	返 回 值: 返回0表示正确应答，1表示无器件响应
**********************************************************************************************************/

uint8_t i2c_WaitAck( I2C *i2c )
{
	uint8_t re;

	i2c->IIC_SDA_H();	/* CPU释放SDA总线 */
	i2c_Delay();
	i2c->IIC_SCL_H();	/* CPU驱动SCL = 1, 此时器件会返回ACK应答 */
	i2c_Delay();
        
	if ( i2c->IIC_READ() )	/* CPU读取SDA口线状态 */
	{
		re = 1;
	}
	else
	{
		re = 0;
	}
	i2c->IIC_SCL_L();
	i2c_Delay();
        
	return re;
}


/**********************************************************************************************************
*	函 数 名: i2c_Ack
*	功能说明: CPU产生一个ACK信号
*	形    参：i2c：结构体指针
*	返 回 值: 无
**********************************************************************************************************/

void i2c_Ack( I2C *i2c )
{
	i2c->IIC_SDA_L();	/* CPU驱动SDA = 0 */
	i2c_Delay();
	i2c->IIC_SCL_H();	/* CPU产生1个时钟 */
	i2c_Delay();
	i2c->IIC_SCL_L();
	i2c_Delay();
	i2c->IIC_SDA_H();	/* CPU释放SDA总线 */
}


/**********************************************************************************************************
*	函 数 名: i2c_NAck
*	功能说明: CPU产生1个NACK信号
*	形    参：i2c：结构体指针
*	返 回 值: 无
**********************************************************************************************************/

void i2c_NAck( I2C *i2c )
{
	i2c->IIC_SDA_H();	/* CPU驱动SDA = 1 */
	i2c_Delay();
	i2c->IIC_SCL_H();	/* CPU产生1个时钟 */
	i2c_Delay();
	i2c->IIC_SCL_L();
	i2c_Delay();
}


/**********************************************************************************************************
*	函 数 名: i2c_CheckDevice
*	功能说明: 检测I2C总线设备，CPU向发送设备地址，然后读取设备应答来判断该设备是否存在
*	形    参：i2c：结构体指针，_Address：设备的I2C总线地址
*	返 回 值: 返回值 0 表示正确， 返回1表示未探测到
**********************************************************************************************************/

uint8_t i2c_CheckDevice(I2C *i2c, uint8_t _Address)
{
	uint8_t ucAck;

	if ( i2c->IIC_READ() && i2c->IIC_READ_SCL())
	{
		i2c_Start( i2c );		        /* 发送启动信号 */

		/* 发送设备地址+读写控制bit（0 = w， 1 = r) bit7 先传 */
		i2c_SendByte( i2c, _Address | I2C_WR);
		ucAck = i2c_WaitAck( i2c );	                /* 检测设备的ACK应答 */

		i2c_Stop( i2c );			        /* 发送停止信号 */

		return ucAck;
	}
	return 1;	/* I2C总线异常 */
}
